npm i sequilize  sequilize-cli

дале дрова для бд, для postgress нужно npm i pg

после иницилиализация

npx sequilize-cli init

у нас появатся эти папки

в папке конфиг пороль и логин базы

после в папке model модель базы

в папке migration у нас идут базывые значение для базы, то биш после создание моделей/редактирования папка migration создает в базе базовые значения
миграю можно вроести и не папке с проектом сервера, а отдельно

для создание таблицы команда
npx sequelize-cli model:generate --name (Название таблицы) --attributes (тут перечесляем название колон и их тип)
пример:
npx sequelize-cli model:generate --name User --attributes firstName:string,lastName:string, email:string

после запуска комнды появится файл в названием в папке "model" (можно и в самом файле подреактировать)

для запуска
npx sequelize-cli db:migrate

для заполнение таблиц с базовыми данными нужно создать файл командой
sequelize-cli seed:generate --name demo-(тут название)
он создать файл в папке "seeders" и файл будет носить название (рандомные цифры не знаю они зачем)-demo-(название таблицы).js

где уже нужно отредактировать файл какие данные будут в начале

для запуска заполнение базовыми данными 
sequelize-cli db:seed:all


